yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151g4.h
#define USART1_CR3_LBCL          USART1_CR3_bit.LBCL
#define USART1_CR3_CPHA          USART1_CR3_bit.CPHA
#define USART1_CR3_CPOL          USART1_CR3_bit.CPOL
#define USART1_CR3_CLKEN         USART1_CR3_bit.CLKEN
#define USART1_CR3_STOP0         USART1_CR3_bit.STOP0
#define USART1_CR3_STOP1         USART1_CR3_bit.STOP1

#define USART1_CR4_ADD0          USART1_CR4_bit.ADD0
#define USART1_CR4_ADD1          USART1_CR4_bit.ADD1
#define USART1_CR4_ADD2          USART1_CR4_bit.ADD2
#define USART1_CR4_ADD3          USART1_CR4_bit.ADD3

#define USART1_CR5_EIE           USART1_CR5_bit.EIE
#define USART1_CR5_IREN          USART1_CR5_bit.IREN
#define USART1_CR5_IRLP          USART1_CR5_bit.IRLP
#define USART1_CR5_HDSEL         USART1_CR5_bit.HDSEL
#define USART1_CR5_NACK          USART1_CR5_bit.NACK
#define USART1_CR5_SCEN          USART1_CR5_bit.SCEN
#define USART1_CR5_DMAR          USART1_CR5_bit.DMAR
#define USART1_CR5_DMAT          USART1_CR5_bit.DMAT

#endif

/*-------------------------------------------------------------------------
 *      USART1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_USART1_SR_PE        0x01
#define MASK_USART1_SR_FE        0x02
#define MASK_USART1_SR_NF        0x04
#define MASK_USART1_SR_OR        0x08
#define MASK_USART1_SR_IDLE      0x10
#define MASK_USART1_SR_RXNE      0x20
#define MASK_USART1_SR_TC        0x40
#define MASK_USART1_SR_TXE       0x80

#define MASK_USART1_BRR1_USART_DIV4 0x01
#define MASK_USART1_BRR1_USART_DIV5 0x02
#define MASK_USART1_BRR1_USART_DIV6 0x04
#define MASK_USART1_BRR1_USART_DIV7 0x08
#define MASK_USART1_BRR1_USART_DIV8 0x10
#define MASK_USART1_BRR1_USART_DIV9 0x20
#define MASK_USART1_BRR1_USART_DIV10 0x40
#define MASK_USART1_BRR1_USART_DIV11 0x80

#define MASK_USART1_BRR2_USART_DIV0 0x01
#define MASK_USART1_BRR2_USART_DIV1 0x02
#define MASK_USART1_BRR2_USART_DIV2 0x04
#define MASK_USART1_BRR2_USART_DIV3 0x08
#define MASK_USART1_BRR2_USART_DIV12 0x10
#define MASK_USART1_BRR2_USART_DIV13 0x20
#define MASK_USART1_BRR2_USART_DIV14 0x40
#define MASK_USART1_BRR2_USART_DIV15 0x80

#define MASK_USART1_CR1_PIEN     0x01
#define MASK_USART1_CR1_PS       0x02
#define MASK_USART1_CR1_PCEN     0x04
#define MASK_USART1_CR1_WAKE     0x08
#define MASK_USART1_CR1_M        0x10
#define MASK_USART1_CR1_USARTD   0x20
#define MASK_USART1_CR1_T8       0x40
#define MASK_USART1_CR1_R8       0x80

#define MASK_USART1_CR2_SBK      0x01
#define MASK_USART1_CR2_RWU      0x02
#define MASK_USART1_CR2_REN      0x04
#define MASK_USART1_CR2_TEN      0x08
#define MASK_USART1_CR2_ILIEN    0x10
#define MASK_USART1_CR2_RIEN     0x20
#define MASK_USART1_CR2_TCIEN    0x40
#define MASK_USART1_CR2_TIEN     0x80

#define MASK_USART1_CR3_LBCL     0x01
#define MASK_USART1_CR3_CPHA     0x02
#define MASK_USART1_CR3_CPOL     0x04
#define MASK_USART1_CR3_CLKEN    0x08
#define MASK_USART1_CR3_STOP0    0x10
#define MASK_USART1_CR3_STOP1    0x20

#define MASK_USART1_CR4_ADD0     0x01
#define MASK_USART1_CR4_ADD1     0x02
#define MASK_USART1_CR4_ADD2     0x04
#define MASK_USART1_CR4_ADD3     0x08

#define MASK_USART1_CR5_EIE      0x01
#define MASK_USART1_CR5_IREN     0x02
#define MASK_USART1_CR5_IRLP     0x04
#define MASK_USART1_CR5_HDSEL    0x08
#define MASK_USART1_CR5_NACK     0x10
#define MASK_USART1_CR5_SCEN     0x20
#define MASK_USART1_CR5_DMAR     0x40
#define MASK_USART1_CR5_DMAT     0x80


/*-------------------------------------------------------------------------
 *      TIM2 register definitions
 *-----------------------------------------------------------------------*/
/* TIM2 control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CEN         : 1;
  unsigned char UDIS        : 1;
  unsigned char URS         : 1;
  unsigned char OPM         : 1;
  unsigned char DIR         : 1;
  unsigned char CMS         : 2;
  unsigned char ARPE        : 1;
} __BITS_TIM2_CR1;
#endif
__IO_REG8_BIT(TIM2_CR1,    0x5250, __READ_WRITE, __BITS_TIM2_CR1);

/* TIM2 control register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char             : 3;
  unsigned char CCDS        : 1;
  unsigned char MMS         : 3;
  unsigned char TI1S        : 1;
} __BITS_TIM2_CR2;
#endif
__IO_REG8_BIT(TIM2_CR2,    0x5251, __READ_WRITE, __BITS_TIM2_CR2);

/* TIM2 Slave mode control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char SMS         : 3;
  unsigned char             : 1;
  unsigned char TS          : 3;
  unsigned char MSM         : 1;
} __BITS_TIM2_SMCR;
#endif
__IO_REG8_BIT(TIM2_SMCR,   0x5252, __READ_WRITE, __BITS_TIM2_SMCR);

/* TIM2 external trigger register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ETF         : 4;
  unsigned char ETPS        : 2;
  unsigned char ECE         : 1;
  unsigned char ETP         : 1;
} __BITS_TIM2_ETR;
#endif
__IO_REG8_BIT(TIM2_ETR,    0x5253, __READ_WRITE, __BITS_TIM2_ETR);

/* TIM2 DMA1 request enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UDE         : 1;
  unsigned char CC1DE       : 1;
  unsigned char CC2DE       : 1;
} __BITS_TIM2_DER;
#endif
__IO_REG8_BIT(TIM2_DER,    0x5254, __READ_WRITE, __BITS_TIM2_DER);

/* TIM2 interrupt enable register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIE         : 1;
  unsigned char CC1IE       : 1;
  unsigned char CC2IE       : 1;
  unsigned char             : 3;
  unsigned char TIE         : 1;
  unsigned char BIE         : 1;
} __BITS_TIM2_IER;
#endif
__IO_REG8_BIT(TIM2_IER,    0x5255, __READ_WRITE, __BITS_TIM2_IER);

/* TIM2 status register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char UIF         : 1;
  unsigned char CC1IF       : 1;
  unsigned char CC2IF       : 1;
  unsigned char             : 3;
  unsigned char TIF         : 1;
  unsigned char BIF         : 1;
} __BITS_TIM2_SR1;
#endif
__IO_REG8_BIT(TIM2_SR1,    0x5256, __READ_WRITE, __BITS_TIM2_SR1);

