yvkonkov91/Microcontrolers-arm/stm8/Project/lib/lib3/inc/iostm8l151g4.h
#define ADC1_CR3_CHSEL           ADC1_CR3_bit.CHSEL
#define ADC1_CR3_SMTP2           ADC1_CR3_bit.SMTP2

#define ADC1_SR_EOC              ADC1_SR_bit.EOC
#define ADC1_SR_AWD              ADC1_SR_bit.AWD
#define ADC1_SR_OVER             ADC1_SR_bit.OVER

#define ADC1_DRH_CONV_DATA8      ADC1_DRH_bit.CONV_DATA8
#define ADC1_DRH_CONV_DATA9      ADC1_DRH_bit.CONV_DATA9
#define ADC1_DRH_CONV_DATA10     ADC1_DRH_bit.CONV_DATA10
#define ADC1_DRH_CONV_DATA11     ADC1_DRH_bit.CONV_DATA11

#define ADC1_DRL_CONV_DATA0      ADC1_DRL_bit.CONV_DATA0
#define ADC1_DRL_CONV_DATA1      ADC1_DRL_bit.CONV_DATA1
#define ADC1_DRL_CONV_DATA2      ADC1_DRL_bit.CONV_DATA2
#define ADC1_DRL_CONV_DATA3      ADC1_DRL_bit.CONV_DATA3
#define ADC1_DRL_CONV_DATA4      ADC1_DRL_bit.CONV_DATA4
#define ADC1_DRL_CONV_DATA5      ADC1_DRL_bit.CONV_DATA5
#define ADC1_DRL_CONV_DATA6      ADC1_DRL_bit.CONV_DATA6
#define ADC1_DRL_CONV_DATA7      ADC1_DRL_bit.CONV_DATA7

#define ADC1_HTRH_HT8            ADC1_HTRH_bit.HT8
#define ADC1_HTRH_HT9            ADC1_HTRH_bit.HT9
#define ADC1_HTRH_HT10           ADC1_HTRH_bit.HT10
#define ADC1_HTRH_HT11           ADC1_HTRH_bit.HT11

#define ADC1_HTRL_HT0            ADC1_HTRL_bit.HT0
#define ADC1_HTRL_HT1            ADC1_HTRL_bit.HT1
#define ADC1_HTRL_HT2            ADC1_HTRL_bit.HT2
#define ADC1_HTRL_HT3            ADC1_HTRL_bit.HT3
#define ADC1_HTRL_HT4            ADC1_HTRL_bit.HT4
#define ADC1_HTRL_HT5            ADC1_HTRL_bit.HT5
#define ADC1_HTRL_HT6            ADC1_HTRL_bit.HT6
#define ADC1_HTRL_HT7            ADC1_HTRL_bit.HT7

#define ADC1_LTRH_LT8            ADC1_LTRH_bit.LT8
#define ADC1_LTRH_LT9            ADC1_LTRH_bit.LT9
#define ADC1_LTRH_LT10           ADC1_LTRH_bit.LT10
#define ADC1_LTRH_LT11           ADC1_LTRH_bit.LT11

#define ADC1_LTRL_LT0            ADC1_LTRL_bit.LT0
#define ADC1_LTRL_LT1            ADC1_LTRL_bit.LT1
#define ADC1_LTRL_LT2            ADC1_LTRL_bit.LT2
#define ADC1_LTRL_LT3            ADC1_LTRL_bit.LT3
#define ADC1_LTRL_LT4            ADC1_LTRL_bit.LT4
#define ADC1_LTRL_LT5            ADC1_LTRL_bit.LT5
#define ADC1_LTRL_LT6            ADC1_LTRL_bit.LT6
#define ADC1_LTRL_LT7            ADC1_LTRL_bit.LT7

#define ADC1_SQR1_CHSEL_S24      ADC1_SQR1_bit.CHSEL_S24
#define ADC1_SQR1_CHSEL_S25      ADC1_SQR1_bit.CHSEL_S25
#define ADC1_SQR1_CHSEL_S26      ADC1_SQR1_bit.CHSEL_S26
#define ADC1_SQR1_CHSEL_S27      ADC1_SQR1_bit.CHSEL_S27
#define ADC1_SQR1_CHSEL_S28      ADC1_SQR1_bit.CHSEL_S28
#define ADC1_SQR1_CHSEL_S29      ADC1_SQR1_bit.CHSEL_S29
#define ADC1_SQR1_DMAOFF         ADC1_SQR1_bit.DMAOFF

#define ADC1_SQR2_CHSEL_S16      ADC1_SQR2_bit.CHSEL_S16
#define ADC1_SQR2_CHSEL_S17      ADC1_SQR2_bit.CHSEL_S17
#define ADC1_SQR2_CHSEL_S18      ADC1_SQR2_bit.CHSEL_S18
#define ADC1_SQR2_CHSEL_S19      ADC1_SQR2_bit.CHSEL_S19
#define ADC1_SQR2_CHSEL_S20      ADC1_SQR2_bit.CHSEL_S20
#define ADC1_SQR2_CHSEL_S21      ADC1_SQR2_bit.CHSEL_S21
#define ADC1_SQR2_CHSEL_S22      ADC1_SQR2_bit.CHSEL_S22
#define ADC1_SQR2_CHSEL_S23      ADC1_SQR2_bit.CHSEL_S23

#define ADC1_SQR3_CHSEL_S8       ADC1_SQR3_bit.CHSEL_S8
#define ADC1_SQR3_CHSEL_S9       ADC1_SQR3_bit.CHSEL_S9
#define ADC1_SQR3_CHSEL_S10      ADC1_SQR3_bit.CHSEL_S10
#define ADC1_SQR3_CHSEL_S11      ADC1_SQR3_bit.CHSEL_S11
#define ADC1_SQR3_CHSEL_S12      ADC1_SQR3_bit.CHSEL_S12
#define ADC1_SQR3_CHSEL_S13      ADC1_SQR3_bit.CHSEL_S13
#define ADC1_SQR3_CHSEL_S14      ADC1_SQR3_bit.CHSEL_S14
#define ADC1_SQR3_CHSEL_S15      ADC1_SQR3_bit.CHSEL_S15

#define ADC1_SQR4_CHSEL_S0       ADC1_SQR4_bit.CHSEL_S0
#define ADC1_SQR4_CHSEL_S1       ADC1_SQR4_bit.CHSEL_S1
#define ADC1_SQR4_CHSEL_S2       ADC1_SQR4_bit.CHSEL_S2
#define ADC1_SQR4_CHSEL_S3       ADC1_SQR4_bit.CHSEL_S3
#define ADC1_SQR4_CHSEL_S4       ADC1_SQR4_bit.CHSEL_S4
#define ADC1_SQR4_CHSEL_S5       ADC1_SQR4_bit.CHSEL_S5
#define ADC1_SQR4_CHSEL_S6       ADC1_SQR4_bit.CHSEL_S6
#define ADC1_SQR4_CHSEL_S7       ADC1_SQR4_bit.CHSEL_S7

#define ADC1_TRIGR1_TRIG24       ADC1_TRIGR1_bit.TRIG24
#define ADC1_TRIGR1_TRIG25       ADC1_TRIGR1_bit.TRIG25
#define ADC1_TRIGR1_TRIG26       ADC1_TRIGR1_bit.TRIG26
#define ADC1_TRIGR1_TRIG27       ADC1_TRIGR1_bit.TRIG27
#define ADC1_TRIGR1_VREFINTON    ADC1_TRIGR1_bit.VREFINTON
#define ADC1_TRIGR1_TSON         ADC1_TRIGR1_bit.TSON

#define ADC1_TRIGR2_TRIG16       ADC1_TRIGR2_bit.TRIG16
#define ADC1_TRIGR2_TRIG17       ADC1_TRIGR2_bit.TRIG17
#define ADC1_TRIGR2_TRIG18       ADC1_TRIGR2_bit.TRIG18
#define ADC1_TRIGR2_TRIG19       ADC1_TRIGR2_bit.TRIG19
#define ADC1_TRIGR2_TRIG20       ADC1_TRIGR2_bit.TRIG20
#define ADC1_TRIGR2_TRIG21       ADC1_TRIGR2_bit.TRIG21
#define ADC1_TRIGR2_TRIG22       ADC1_TRIGR2_bit.TRIG22
#define ADC1_TRIGR2_TRIG23       ADC1_TRIGR2_bit.TRIG23

#define ADC1_TRIGR3_TRIG8        ADC1_TRIGR3_bit.TRIG8
#define ADC1_TRIGR3_TRIG9        ADC1_TRIGR3_bit.TRIG9
#define ADC1_TRIGR3_TRIG10       ADC1_TRIGR3_bit.TRIG10
#define ADC1_TRIGR3_TRIG11       ADC1_TRIGR3_bit.TRIG11
#define ADC1_TRIGR3_TRIG12       ADC1_TRIGR3_bit.TRIG12
#define ADC1_TRIGR3_TRIG13       ADC1_TRIGR3_bit.TRIG13
#define ADC1_TRIGR3_TRIG14       ADC1_TRIGR3_bit.TRIG14
#define ADC1_TRIGR3_TRIG15       ADC1_TRIGR3_bit.TRIG15

#define ADC1_TRIGR4_TRIG0        ADC1_TRIGR4_bit.TRIG0
#define ADC1_TRIGR4_TRIG1        ADC1_TRIGR4_bit.TRIG1
#define ADC1_TRIGR4_TRIG2        ADC1_TRIGR4_bit.TRIG2
#define ADC1_TRIGR4_TRIG3        ADC1_TRIGR4_bit.TRIG3
#define ADC1_TRIGR4_TRIG4        ADC1_TRIGR4_bit.TRIG4
#define ADC1_TRIGR4_TRIG5        ADC1_TRIGR4_bit.TRIG5
#define ADC1_TRIGR4_TRIG6        ADC1_TRIGR4_bit.TRIG6
#define ADC1_TRIGR4_TRIG7        ADC1_TRIGR4_bit.TRIG7

#endif

/*-------------------------------------------------------------------------
 *      ADC1 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_ADC1_CR1_ADON       0x01
#define MASK_ADC1_CR1_START      0x02
#define MASK_ADC1_CR1_CONT       0x04
#define MASK_ADC1_CR1_EOCIE      0x08
#define MASK_ADC1_CR1_AWDIE      0x10
#define MASK_ADC1_CR1_RES        0x60
#define MASK_ADC1_CR1_OVERIE     0x80

